class BanglaWord:
	def __init__(self):
		self.words_in_bangla = [
			"", "এক", "দুই", "তিন", "চার", "পাঁচ", "ছয়", "সাত", "আট", "নয়", "দশ", "এগারো", "বারো", "তেরো", "চৌদ্দ",
			"পনেরো", "ষোল", "সতেরো", "আঠারো", "উনিশ", "বিশ", "একুশ", "বাইশ", "তেইশ", "চব্বিশ", "পঁচিশ", "ছাব্বিশ",
			"সাতাশ", "আঠাশ", "ঊনত্রিশ", "ত্রিশ", "একত্রিশ", "বত্রিশ", "তেত্রিশ", "চৌত্রিশ", "পঁয়ত্রিশ", "ছত্রিশ",
			"সাঁইত্রিশ", "আটত্রিশ", "ঊনচল্লিশ", "চল্লিশ", "একচল্লিশ", "বিয়াল্লিশ", "তেতাল্লিশ", "চুয়াল্লিশ",
			"পঁয়তাল্লিশ", "ছেচল্লিশ", "সাতচল্লিশ", "আটচল্লিশ", "ঊনপঞ্চাশ", "পঞ্চাশ", "একান্ন", "বাহান্ন", "তিপ্পান্ন",
			"চুয়ান্ন", "পঞ্চান্ন", "ছাপ্পান্ন", "সাতান্ন", "আটান্ন", "ঊনষাট", "ষাট", "একষট্টি", "বাষট্টি", "তেষট্টি",
			"চৌষট্টি", "পঁয়ষট্টি", "ছেষট্টি", "সাতষট্টি", "আটষট্টি", "ঊনসত্তর", "সত্তর", "একাত্তর", "বাহাত্তর",
			"তিয়াত্তর", "চুয়াত্তর", "পঁচাত্তর", "ছিয়াত্তর", "সাতাত্তর", "আটাত্তর", "ঊনআশি", "আশি", "একাশি", "বিরাশি",
			"তিরাশি", "চুরাশি", "পঁচাশি", "ছিয়াশি", "সাতাশি", "আটাশি", "ঊননব্বই", "নব্বই", "একানব্বই", "বিরানব্বই",
			"তিরানব্বই", "চুরানব্বই", "পঁচানব্বই", "ছিয়ানব্বই", "সাতানব্বই", "আটানব্বই", "নিরানব্বই"
		]
		# self.words_in_bangla = {
		# 	"0": "শূন্য",
		# 	"1": "এক",
		# 	"2": "দুই",
		# 	"3": "তিন",
		# 	"4": "চার",
		# 	"5": "পাঁচ",
		# 	"6": "ছয়",
		# 	"7": "সাত",
		# 	"8": "আট",
		# 	"9": "নয়",
		# 	"10": "দশ",
		# 	"11": "এগারো",
		# 	"12": "বারো",
		# 	"13": "তেরো",
		# 	"14": "চৌদ্দ",
		# 	"15": "পনেরো",
		# 	"16": "ষোল",
		# 	"17": "সতেরো",
		# 	"18": "আঠারো",
		# 	"19": "উনিশ",
		# 	"20": "বিশ",
		# 	"21": "একুশ",
		# 	"22": "বাইশ",
		# 	"23": "তেইশ",
		# 	"24": "চব্বিশ",
		# 	"25": "পঁচিশ",
		# 	"26": "ছাব্বিশ",
		# 	"27": "সাতাশ",
		# 	"28": "আঠাশ",
		# 	"29": "ঊনত্রিশ",
		# 	"30": "ত্রিশ",
		# 	"31": "একত্রিশ",
		# 	"32": "বত্রিশ",
		# 	"33": "তেত্রিশ",
		# 	"34": "চৌত্রিশ",
		# 	"35": "পঁয়ত্রিশ",
		# 	"36": "ছত্রিশ",
		# 	"37": "সাঁইত্রিশ",
		# 	"38": "আটত্রিশ",
		# 	"39": "ঊনচল্লিশ",
		# 	"40": "চল্লিশ",
		# 	"41": "একচল্লিশ",
		# 	"42": "বিয়াল্লিশ",
		# 	"43": "তেতাল্লিশ",
		# 	"44": "চুয়াল্লিশ",
		# 	"45": "পঁয়তাল্লিশ",
		# 	"46": "ছেচল্লিশ",
		# 	"47": "সাতচল্লিশ",
		# 	"48": "আটচল্লিশ",
		# 	"49": "ঊনপঞ্চাশ",
		# 	"50": "পঞ্চাশ",
		# 	"51": "একান্ন",
		# 	"52": "বাহান্ন",
		# 	"53": "তিপ্পান্ন",
		# 	"54": "চুয়ান্ন",
		# 	"55": "পঞ্চান্ন",
		# 	"56": "ছাপ্পান্ন",
		# 	"57": "সাতান্ন",
		# 	"58": "আটান্ন",
		# 	"59": "ঊনষাট",
		# 	"60": "ষাট",
		# 	"61": "একষট্টি",
		# 	"62": "বাষট্টি",
		# 	"63": "তেষট্টি",
		# 	"64": "চৌষট্টি",
		# 	"65": "পঁয়ষট্টি",
		# 	"66": "ছেষট্টি",
		# 	"67": "সাতষট্টি",
		# 	"68": "আটষট্টি",
		# 	"69": "ঊনসত্তর",
		# 	"70": "সত্তর",
		# 	"71": "একাত্তর",
		# 	"72": "বাহাত্তর",
		# 	"73": "তিয়াত্তর",
		# 	"74": "চুয়াত্তর",
		# 	"75": "পঁচাত্তর",
		# 	"76": "ছিয়াত্তর",
		# 	"77": "সাতাত্তর",
		# 	"78": "আটাত্তর",
		# 	"79": "ঊনআশি",
		# 	"80": "আশি",
		# 	"81": "একাশি",
		# 	"82": "বিরাশি",
		# 	"83": "তিরাশি",
		# 	"84": "চুরাশি",
		# 	"85": "পঁচাশি",
		# 	"86": "ছিয়াশি",
		# 	"87": "সাতাশি",
		# 	"88": "আটাশি",
		# 	"89": "ঊননব্বই",
		# 	"90": "নব্বই",
		# 	"91": "একানব্বই",
		# 	"92": "বিরানব্বই",
		# 	"93": "তিরানব্বই",
		# 	"94": "চুরানব্বই",
		# 	"95": "পঁচানব্বই",
		# 	"96": "ছিয়ানব্বই",
		# 	"97": "সাতানব্বই",
		# 	"98": "আটানব্বই",
		# 	"99": "নিরানব্বই",
		# }
		# self.numbers = {
		# 	"0": "০",
		# 	"1": "১",
		# 	"2": "২",
		# 	"3": "৩",
		# 	"4": "৪",
		# 	"5": "৫",
		# 	"6": "৬",
		# 	"7": "৭",
		# 	"8": "৮",
		# 	"9": "৯",
		# }
		self.numbers = ["০", "১", "২", "৩", "৪", "৫", "৬", "৭", "৮", "৯"]

	# self.ones = ["", "এক ", "দুই ", "তিন ", "চার ", "পাঁচ ", "ছয় ", "সাত ", "আট ", "নয় "]
	# self.tens = ["দশ ", "এগারো ", "বারো ", "তেরো ", "চৌদ্দ", "পনেরো ", "ষোল ", "সতেরো ", "আঠারো ", "উনিশ "]
	# self.twenties = ["", "", "বিশ ", "ত্রিশ ", "চল্লিশ ", "পঞ্চাশ ", "ষাট ", "সত্তর ", "আশি ", "নব্বই"]
	# self.thousands = ["", "হাজার ", "মিলিয়ন ", "বিলিয়ন ", "ট্রিলিয়ন "]

	def bangla_number(self, number):
		return self.convert(str(number), self.numbers)

	def bangla_word(self, number):
		if number == "0":
			return "শূন্য"
		output = ''
		if type(number) == float:
			number = str(number).split(".")
			output = self.bangla_word_in_format(int(number[0]))
			if number[1]:
				output += " দশমিক " + self.convert(str(number[1]), self.words_in_bangla)
			return output
		else:
			return self.convert(str(number), self.words_in_bangla)

	def bangla_word_in_format(self, number):
		output = ''
		get_cr = int(number / 10000000)
		if get_cr != 0:
			if get_cr > 99:
				output += self.bangla_word(get_cr) + ' কোটি '
			else:
				output += self.words_in_bangla[get_cr] + ' কোটি '

		get_cr_mod = number % 10000000

		get_lkh = int(get_cr_mod / 100000)
		if get_lkh > 0:
			output += self.words_in_bangla[get_lkh] + ' লক্ষ '

		get_lkh_mod = get_cr_mod % 100000

		thousand = int(get_lkh_mod / 1000)
		if thousand > 0:
			output += self.words_in_bangla[thousand] + ' হাজার '
		thousand_div = get_lkh_mod % 1000
		hundred = int(thousand_div / 100)
		if hundred > 0:
			output += self.words_in_bangla[hundred] + ' শত '
		hundred_div = int(thousand_div % 100)

		if hundred_div > 0:
			output += self.words_in_bangla[hundred_div]

		return output

	@staticmethod
	def convert(given, replace):
		for index, value in enumerate(replace):
			given = given.replace(str(index), value)
		return given
